# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Step 3

In [6]:
# Step 3
path = r'/Users/taraross/Desktop/all/DataAnalytics/Tasks/Achievment4/Instacart Basket Analysis'

In [7]:
customers = pd.read_csv(os.path.join(path, '02 Data','Original Data', 'customers.csv'), index_col = False)

In [9]:
#Preview new data
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
customers.shape

(206209, 10)

In [12]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [14]:
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

### Step 4 Wrangle Data

In [16]:
#Rename columns 
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [18]:
customers.rename(columns = {'Surnam' : 'surnam'}, inplace = True)

In [19]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [20]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [21]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [22]:
customers.rename(columns = {'fam_status' : 'martial_status'}, inplace = True)

In [23]:
customers.columns

Index(['user_id', 'first_name', 'surnam', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'martial_status', 'income'],
      dtype='object')

In [24]:
customers.head()

,user_id,first_name,surnam,gender,state,age,date_joined,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [25]:
# columns have been successfully renamed

In [26]:
#I don't think it's necessary to drop any of the columns. All of the data seems important

### Step 5 Data Quality and Consistency Checks

In [27]:
customers.dtypes

user_id            int64
first_name        object
surnam            object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
martial_status    object
income             int64
dtype: object

In [28]:
# Checking for mixed data-types in each column
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [29]:
#output told us that first_name was a mixed type so we need to address it
customers['first_name'] = customers['first_name'].astype('str')

In [30]:
#user_id is listed as integer, however it should be a str
customers['user_id'] = customers['user_id'].astype('str')

In [32]:
customers.dtypes

user_id           object
first_name        object
surnam            object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
martial_status    object
income             int64
dtype: object

In [33]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [34]:
#now columns are the right data types and there are no mixed data types

In [35]:
#check for dupes
customers_dups = customers[customers.duplicated()]

In [36]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surnam, gender, state, age, date_joined, n_dependants, martial_status, income]
Index: []

In [37]:
#no dupes

In [38]:
customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

There's nothing unusual in the descriptivev statistics and all dupes and mixed types are taken care of.

### Step 6 Combine the Data

In [51]:
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_grouped.pkl'))

In [52]:
ords_prods.shape

(32404859, 25)

In [53]:
customers.shape

(206209, 10)

In [54]:
ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_product_price,spending_flag,median_days,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low Spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low Spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low Spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Least busy,Most orders,3,New customer,4.972414,Low Spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Least busy,Average orders,3,New customer,4.972414,Low Spender,9.0,Frequent customer

In [55]:
customers.head()

,user_id,first_name,surnam,gender,state,age,date_joined,n_dependants,martial_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [56]:
#Both share the column 'user_id'

In [57]:
ords_prods.dtypes['user_id']

dtype('int64')

In [59]:
customers.dtypes['user_id']

dtype('O')

In [60]:
#make them the same type
ords_prods['user_id'] = ords_prods['user_id'].astype('str')

In [61]:
ords_prods.dtypes['user_id']

dtype('O')

In [62]:
#Now they have matching types

In [63]:
# Drop the existing '_merge' column from previous exercises
ords_prods = ords_prods.drop(columns=['_merge'])

In [64]:
# merge dataframes
custs_ords_prods = ords_prods.merge(customers, on = 'user_id', indicator = True)

In [65]:
# check new dataframe
custs_ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,first_name,surnam,gender,state,age,date_joined,n_dependants,martial_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both

In [67]:
#check it merged okay
custs_ords_prods['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [68]:
#Check data types
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
mean_product_price         float64
spending_flag               object
median_days                float64
frequency_flag              object
first_name                  object
surnam                      object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
martial_status              object
income                       int64
_merge                    category
dtype: object

In [70]:
# The 'order_id' column also has the wrong data type, so change to str
custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

In [72]:
# The 'product_id' column also has the wrong data type, so change to str
custs_ords_prods['product_id'] = custs_ords_prods['product_id'].astype('str')

In [73]:
custs_ords_prods.dtypes

product_id                  object
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                    object
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
first_order                   bool
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
mean_product_price         float64
spending_flag               object
median_days                float64
frequency_flag              object
first_name                  object
surnam                      object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
martial_status              object
income                       int64
_merge                    category
dtype: object

# Step 8 Export

In [74]:
custs_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_merged.pkl'))